Autodesk.Revit.Creation.Document.NewTakeoffFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.MEPCurve)
Add a new family instance of an takeoff fitting into the Autodesk Revit document,
using one connector and one MEP curve.
connector: The connector to be connected to the takeoff.
curve: The duct or pipe which is the trunk for the takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or curve is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connector and the curve cannot be used for takeoff creation. For example,
they must be of the same domain, the curve must be a duct or pipe,
and the owner of the connector should be (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when takeoff fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewFlexPipe(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document,
using two connector, and flexible pipe type.
connector1:  The first connector to be connected to the pipe.
connector2:  The second connector to be connected to the pipe.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the flexible pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connectors, no connection will be established.

Autodesk.Revit.Creation.Document.NewFlexPipe(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document,
using a connector, point array and pipe type.
connector:  The connector to be connected to the flexible pipe, including the end points.
points: The point array indicating the path of the flexible pipe.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.

Autodesk.Revit.Creation.Document.NewFlexPipe(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document.
Adds a new flexible pipe into the document,
using a point array and pipe type.
points: The point array indicating the path of the flexible pipe, including the end points.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewFlexDuct(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document,
using two connector, and duct type.
connector1:  The first connector to be connected to the duct.
connector2:  The second connector to be connected to the duct.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the flexible duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.

Autodesk.Revit.Creation.Document.NewFlexDuct(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document,
using a connector, point array and duct type.
connector:  The connector to be connected to the duct, including the end points.
points: The point array indicating the path of the flexible duct.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.

Autodesk.Revit.Creation.Document.NewPipe(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Plumbing.PipeType)
Adds a new pipe into the document,
using two connectors and duct type.
connector1:  The first connector to be connected to the pipe.
connector2:  The second connector to be connected to the pipe.
pipeType:  The type of the pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connectors
will govern the endpoints of the pipe, but no connection will be established.

Autodesk.Revit.Creation.Document.NewPipe(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Plumbing.PipeType)
Adds a new pipe into the document,
using a point, connector and pipe type.
point:  The first point of the pipe.
connector:  The connector to be connected to the pipe.
pipeType:  The type of the pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point or connector is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connector
will govern the endpoints of the pipe, but no connection will be established.

Autodesk.Revit.Creation.Document.NewPipe(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Plumbing.PipeType)
Adds a new pipe into the document.
Adds a new pipe into the document,
using two points and pipe type.
point1:  The first point of the pipe.
point2:  The second point of the pipe.
pipeType:  The type of the pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point1 or point2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new pipe is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewFlexDuct(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document.
Adds a new flexible duct into the document,
using a point array and duct type.
points: The point array indicating the path of the flexible duct, including the end points.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document,
using two connectors and duct type.
connector1:  The first connector to be connected to the duct.
connector2:  The second connector to be connected to the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connectors
will govern the endpoints of the duct, but no connection will be established.

Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document,
using a point, connector and duct type.
point:  The first point of the duct.
connector:  The connector to be connected to the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point or connector is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector if necessary. If the connector's type, domain, or direction
does not match the direction of the duct to be created, the position of the input connector
will govern the endpoints of the duct, but no connection will be established.

Autodesk.Revit.Creation.Document.NewDuct(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Mechanical.DuctType)
Adds a new duct into the document.
Adds a new duct into the document,
using two points and duct type.
point1:  The first point of the duct.
point2:  The second point of the duct.
ductType:  The type of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument point1 or point2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new duct is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a curve, type/symbol and reference level.
curve: The curve where the instance is based.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to insert one family instance into another element along the geometry of a curve.
If the instance fails to be created an
exception may be thrown.
The type/symbol that is used must be loaded into the document before this
method is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods. The host object must be one that supports insertion of
instances otherwise this method will fail. All levels within the document can be found by iterating
over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document, using a location,
type/symbol and a base level.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to add a family instance that doesn't require a host element, but that can be associated
to a level.  If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document before this
method is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods. All levels within the document can be found by iterating
over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.Some families, such as Beams, have more than one endpoint and are inserted in the same manner as single
point instances. Once inserted these linear family instances can have their endpoints changed by
using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a location, type/symbol, the host element and a base level.
location: The physical location where the instance is to be placed on the specified level.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  A host object into which the instance will be embedded
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This form of NewFamilyInstance is the most commonly used in Autodesk Revit since there are
a large number of elements that use levels, such as Walls, Columns etc. If the instance fails to
be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. All levels within the document can be found by iterating over
the entire document and searching for objects of type Autodesk.Revit.Elements.Level. Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point
instances. Once inserted these linear family instances can have their endpoints changed by using
the instance's Element.Location property.Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.

Autodesk.Revit.Creation.Document.NewFascia(Autodesk.Revit.DB.Architecture.FasciaType,Autodesk.Revit.DB.Reference)
Creates a fascia along a reference.
FasciaType:  The type of the fascia to create
reference:  A planar line or arc that represents the place where you
want to place the fascia.
Returns:  If successful a new fascia object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewFascia(Autodesk.Revit.DB.Architecture.FasciaType,Autodesk.Revit.DB.ReferenceArray)
Creates a fascia.
Creates a fascia along a reference array.
FasciaType:  The type of the fascia to create
references:  An array of planar lines and arcs that represents the place where you
want to place the fascia.
Returns:  If successful a new fascia object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewGutter(Autodesk.Revit.DB.Architecture.GutterType,Autodesk.Revit.DB.Reference)
Creates a gutter along a reference.
GutterType:  The type of the gutter to create
reference:  A planar line or arc that represents the place where you
want to place the gutter.
Returns:  If successful a new gutter object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewGutter(Autodesk.Revit.DB.Architecture.GutterType,Autodesk.Revit.DB.ReferenceArray)
Creates a gutter.
Creates a gutter along a reference array.
GutterType:  The type of the gutter to create
references:  An array of planar lines and arcs that represents the place where you
want to place the gutter.
Returns:  If successful a new gutter object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewSlabEdge(Autodesk.Revit.DB.SlabEdgeType,Autodesk.Revit.DB.Reference)
Creates a slab edge along a reference.
SlabEdgeType:  The type of the slab edge to create
reference:  A planar line or arc that represents the place where you
want to place the slab edge.
Returns:  If successful a new slab edge object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewSlabEdge(Autodesk.Revit.DB.SlabEdgeType,Autodesk.Revit.DB.ReferenceArray)
Creates a slab edge.
Creates a slab edge along a reference array.
SlabEdgeType:  The type of the slab edge to create
references:  An array of planar lines and arcs that represents the place where you
want to place the slab edge.
Returns:  If successful a new slab edge object within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewCurtainSystem(Autodesk.Revit.DB.FaceArray,Autodesk.Revit.DB.CurtainSystemType)
Creates a new CurtainSystem element from a set of faces.
faces: The faces new CurtainSystem will be created on.
curtainSystemType: The Type of CurtainSystem to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown in following cases:
The input argument faces or curtainSystemType is null.
The size of faces is zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the CurtainSystem cannot be created or regenerate fails.
Returns:  The CurtainSystem created will be returned when the operation succeeds.
Remarks:  The input faces will be copied during the operations so that they can be any
faces.

Autodesk.Revit.Creation.Document.NewCurtainSystem2(Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.CurtainSystemType)
Creates a new CurtainSystem element.
Creates a new CurtainSystem element from a set of face references.
faces: The faces new CurtainSystem will be created on.
curtainSystemType: The Type of CurtainSystem to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown in following cases:
The input argument faces or curtainSystemType is null.
The size of faces is zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the CurtainSystem cannot be created, for example, the input faces don't
belong to same mass or generic model. Or regenerate fails.
Returns:  A set of ElementIds of CurtainSystems will be returned when the operation succeeds.
Remarks:  The faces can belong to different masses or generic models. The number of CurtainSystems will be equal to the number of masses and generic models.

Autodesk.Revit.Creation.Document.NewWire(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Electrical.WireType,Autodesk.Revit.DB.Electrical.WiringType)
Creates a new wire element.
curve:  The base line of the wire.
view:  The view in which the wire is to be visible.
startConnector: The connector which connects with the start point connector of wire, if it is null, the start point connects with nothing.
endConnector: The connector which connects with the end point connector of wire, if it is null, the end point connects with nothing.
wireType: Specify wire type of new created wire.
wiringType: Specify wiring type(Arc or chamfer) of new created wire.
Returns: If successful a new wire element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: An InvalidOperationException will to be thrown when Revit MEP product is unavailable.

Autodesk.Revit.Creation.Document.NewZone(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase)
Creates a new Zone element.
level:  The level on which the Zone is to exist.
phase:  The associative phase on which the Zone is to exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the electrical system cannot be created by these input phase and level.
Returns:  If successful a new Zone element within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewRoomBoundaryLines(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.View)
Creates a new boundary line as an Room border.
sketchPlane: The sketch plan
curves: The geometry curves on which the boundary lines are
view: The View for the new Room

Autodesk.Revit.Creation.Document.NewSpaceBoundaryLines(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.View)
Creates a new boundary line as an Space border.
sketchPlane: The sketch plan
curves: The geometry curves on which the boundary lines are
view: The View for the new Space

Autodesk.Revit.Creation.Document.NewSpaceTag(Autodesk.Revit.DB.Mechanical.Space,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.View)
Creates a new SpaceTag.
space:  The Space which the tag refers.
point:  A 2D point that dictates the location on the level of the space.
view:  The view where the tag will lie.
Returns:  If successful a SpaceTag object will be returned, otherwise null.
Suitable exceptions will be fired if the parameters are invalid.

Autodesk.Revit.Creation.Document.NewSpaces2(Autodesk.Revit.DB.Phase,System.Int32)
Creates a set of new unplaced spaces on a given phase.
phase:  The phase in which the spaces are to exist.
Returns:  If successful, a set of ElementIds of new unplaced spaces are be returned, otherwise null.

Autodesk.Revit.Creation.Document.NewSpaces2(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase,Autodesk.Revit.DB.View)
Creates one or more spaces.
Creates new spaces on the available plan circuits of a the given level.
level:  The level on which the spaces is to exist.
phase:  The phase in which the spaces is to exist.
view:  The view on which the space tags for the spaces are to display.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: The view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The phase is invalid or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase,Autodesk.Revit.DB.UV)
Creates a new space element on the given level, at the given location, and assigned to the given phase.
level:  The level on which the room is to exist.
phase:  The phase in which the room is to exist.
point:  A 2D point that dictates the location on that specified level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when level, phase or point is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the space cannot be created.
Returns:  If successful a new Space element within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.UV)
Creates a new space element on the given level at the given location.
level:  The level on which the space is to exist.
point:  A 2D point that dictates the location on that specified level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when level or point is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the space cannot be created.
Returns:  If successful the new space element is returned, otherwise null.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Phase)
Creates a new space.
Creates a new unplaced space on a given phase.
phase:  The phase in which the space is to exist.
Returns:  If successful the new space should be returned, otherwise null.

Autodesk.Revit.Creation.Document.NewElectricalSystem(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Electrical.ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
electComponents: The electrical components in this system.
elecSysType: The System Type of electrical system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the elecSysType parameter Value is out of the range of ElectricalSystemType.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the electrical system cannot be created by these input electrical components.
Returns:  If successful a new MEP Electrical System element within the project, otherwise null.

Autodesk.Revit.Creation.Document.NewExtrusionRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.ReferencePlane,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,System.Double,System.Double)
Creates a new Extrusion Roof.
profile: The profile of the extrusion roof.
refPlane: The work plane for the extrusion roof.
level: The level of the extrusion roof.
roofType: Type of the extrusion roof.
extrusionStart: Start the extrusion.
extrusionEnd: End the extrusion.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewFootPrintRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,Autodesk.Revit.DB.ModelCurveArray@)
Creates a new FootPrintRoof element.
footPrint: The footprint of the FootPrintRoof.
level: The level of the FootPrintRoof.
roofType: Type of the FootPrintRoof.
footPrintToModelCurvesMapping: An array of Model Curves corresponding to the set of Curves input in the footPrint. By knowing which Model Curve was created by each footPrint curve, you can set properties like SlopeAngle for each curve.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewAreas(System.Collections.Generic.List`1{Autodesk.Revit.Creation.AreaCreationData})
Creates new areas
dataList: A list of AreaCreationData which wraps the creation arguments of the areas to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  If AreaCreationData's areaPoint is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the area cannot be created successfully or the phase is invalid or regeneration fails at the end of the batch creation.
Returns:  If successful an Element Set which contains the areas should be returned, otherwise the exception will be thrown.

Autodesk.Revit.Creation.Document.NewArea(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.UV)
Creates a new area
areaView: The view of area element.
point: The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area

Autodesk.Revit.Creation.Document.NewAreaTag(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.Area,Autodesk.Revit.DB.UV)
Creates a new area tag.
areaView: The area view
point: The position of the area tag

Autodesk.Revit.Creation.Document.NewAreaBoundaryLine(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ViewPlan)
Creates a new boundary line as an Area border.
sketchPlane: The sketch plane.
geometryCurve: The geometry curve on which the boundary line are
areaView: The View for the new Area

Autodesk.Revit.Creation.Document.NewFoundationWall(Autodesk.Revit.DB.ContFootingType,Autodesk.Revit.DB.Wall)
Creates a new continuous footing object.
contFootingType: The ContFooting type.
wall: The Wall to append a ContFooting.

Autodesk.Revit.Creation.Document.NewSlab(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Line,System.Double,System.Boolean)
Creates a slab within the project with the given horizontal profile using the default floor style.
profile:  An array of planar lines and arcs that represent the horizontal profile of the slab.
level: The level on which the slab is to be placed.
slopedArrow:  A line use to control the sloped angle of the slab. It should be in the same face with profile.
slope:  The slope.
isStructural:  If set, specifies that the floor is structural in nature.
Returns:  If successful a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create slab.

Autodesk.Revit.Creation.Document.NewTag(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.Boolean,Autodesk.Revit.DB.TagMode,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Creates a new IndependentTag Element.
dbview:  The view in which the tag is to be visible.
elemToTag:  The host object of tag.
addLeader:  Whether there will be a leader.
tagMode:  The mode of the tag. Add by Category, add by Multi-Category, or add by material.
tagOrientation:  The orientation of the tag.
pnt:  If not using a leader, this is the position of the tag head.  If using a leader, then the tag will be placed with the default leader length as close to this input point as possible.
Returns:  If successful, an IndependentTag object is returned.
Remarks:  This method forms a tag relationship to the host object.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the view is a perspective view.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CurveArray,System.Boolean)
Creates a new opening in a roof, floor and ceiling.
hostElement:  Host element of the opening. Can be a roof, floor, or ceiling.
profile:  Profile of the opening.
bPerpendicularFace: True if the profile is cut perpendicular to the intersecting face of the host. False if the profile is cut vertically.
Returns:  If successful, an Opening object is returned.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a rectangular opening on a wall.
wall:  Host element of the opening.
pntStart: One corner of the rectangle.
pntEnd: The opposite corner of the rectangle.
Returns:  If successful, an Opening object is returned.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.CurveArray)
Creates a new shaft opening between a set of levels.
bottomLevel:  bottom level
topLevel:  top level
profile:  profile of the opening.
Returns:  If successful, an Opening object is returned.
Remarks:  This method forms an opening on floor, ceiling and roof. Make sure topLevel is higher than bottomLevel, otherwise an exception will be returned.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.Creation.eRefFace)
Creates a new opening.
Creates a new opening in a beam, brace and column.
famInstElement:  host element of the opening, can be a beam, brace and column.
profile:  profile of the opening.
iFace:  face on which opening is based on.
Returns:  If successful, an Opening object is returned.
Remarks:  This method forms opening on a beam, brace and column.

Autodesk.Revit.Creation.Document.NewAreaBoundaryConditions(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Area BoundaryConditions element on a host element.
hostElement:  A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Returns: If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.

Autodesk.Revit.Creation.Document.NewLineBoundaryConditions(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Line BoundaryConditions element on a host element.
hostElement:  A Beam.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:  A value indicating the option for rotation about the X axis.
X_RotationSpringModulus:  Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring"
Returns: If successful, NewLineBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 1 - "Line". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Phase,System.Int32)
Creates new unplaced rooms in the given phase.
phase:  The phase on which the rooms are to exist.
count:  The number of the rooms to be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the room can not be created successfully or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase)
Creates new rooms in each plan circuit found in the given level in the given phase.
level:  The level from which the circuits are found.
phase:  The phase on which the room is to exist.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:  If the view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the phase is invalid, or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Level)
Creates new rooms in each plan circuit found in the given level in the last phase.
level:  The level from which the circuits are found.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:  If the view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the phase is invalid, or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms created should be returned, otherwise null.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Architecture.Room,Autodesk.Revit.DB.PlanCircuit)
Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
room:  The room which you want to locate in the circuit.  Pass null to create a new room.
circuit:  The circuit in which you want to locate a room.
Returns:  If successful the room is returned, otherwise null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the existing room is already placed.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Phase)
Creates a new unplaced room and with an assigned phase.
phase:  The phase in which the room is to exist.
Returns:  If successful the new room , otherwise null.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.UV)
Creates a new room.
Creates a new room on a level at a specified point.
level:  The level on which the room is to exist.
point:  A 2D point that dictates the location of the room on that specified level.
Returns:  If successful the new room will be returned, otherwise null.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewGrids(Autodesk.Revit.DB.CurveArray)
Creates new grid lines.
curves: The curves which represent the new grid lines.  These curves must be lines or bounded arcs.
Throws Autodesk.Revit.Exceptions.ArgumentException: If the curve is an unbounded arc (a circle).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  If any curve supplied in the input is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If any grid line is not created successfully or regeneration fails at the end of the batch creation.
Returns:  An Element set that contains the Grids.
Remarks:  All input curves should lie on horizontal planes.

Autodesk.Revit.Creation.Document.NewGrid(Autodesk.Revit.DB.Arc)
Creates a new radial grid line.
arc:  An arc object that represents the location of the new grid line.
Returns:  The newly created grid line.
Remarks:  The arc should be on a horizontal plane.

Autodesk.Revit.Creation.Document.NewGrid(Autodesk.Revit.DB.Line)
Creates a new grid line.
Creates a new linear grid line.
line:  A line object which represents the location of the grid line.
Returns:  The newly created grid line.
Remarks:  The line should be on a horizontal plane.

Autodesk.Revit.Creation.Document.NewViewDrafting
Creates a new drafting view.
Returns: The newly created drafting view.

Autodesk.Revit.Creation.Document.NewFoundationSlab(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a foundation slab within the project with the given horizontal profile and floor style on the specified level.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
normal:  A vector that must be perpendicular to the profile which dictates which side of the floor is considered
to be upper and down.
Returns:  if successful, a new foundation slab object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.

Autodesk.Revit.Creation.Document.NewFloor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a floor within the project with the given horizontal profile and floor style on the specified level with the specified normal vector.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
normal:  A vector that must be perpendicular to the profile which dictates which side of the floor is considered
to be upper and down.
Returns:  if successful, a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.

Autodesk.Revit.Creation.Document.NewFloor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean)
Creates a floor within the project with the given horizontal profile and floor style on the specified level.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
Returns:  if successful, a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.

Autodesk.Revit.Creation.Document.NewSpotElevation(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean)
Generate a new spot elevation object within the project.
view:  The view in which the spot elevation is to be visible.
reference:  The reference to which the spot elevation is to be bound.
origin:  The point which the spot elevation evaluate.
bend:  The bend point for the spot elevation.
end:  The end point for the spot elevation.
refPt:  The actual point on the reference which the spot elevation evaluate.
hasLeader:  Indicate if it has leader or not.
Returns:  If successful a new spot dimension object, otherwise null.
Remarks:  If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt
is the projected point. If the reference is not valid or the point cannot be projected to
reference correctly, an exception will be thrown

Autodesk.Revit.Creation.Document.NewSpotCoordinate(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean)
Generate a new spot coordinate object within the project.
view:  The view in which the spot coordinate is to be visible.
reference:  The reference to which the spot coordinate is to be bound.
origin:  The point which the spot coordinate evaluate.
bend:  The bend point for the spot coordinate.
end:  The end point for the spot coordinate.
refPt:  The actual point on the reference which the spot coordinate evaluate.
hasLeader:  Indicate if it has leader or not.
Returns:  If successful a new spot dimension object, otherwise null.
Remarks:  If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt
is projected point. If the reference is not valid or the point cannot be projected to
reference correctly, an exception will be thrown

Autodesk.Revit.Creation.Document.NewLoadCombination(System.String,System.Int32,System.Int32,System.Double[],Autodesk.Revit.DB.Structure.LoadCaseArray,Autodesk.Revit.DB.Structure.LoadCombinationArray,Autodesk.Revit.DB.Structure.LoadUsageArray)
Creates a new instance of a LoadCombination element
within the project.
name: The not empty name for the Load Combination Element to create.
typeInd: LoadCombination Type Index: 0-Combination, 1-Envelope.
stateInd: LoadCombination State Index: 0-Servicebility, 1-Ultimate.
factors: Factors array for Load Combination formula.
cases: Load Cases array for Load Combination formula.
combinations: Load Combinations array for Load Combination formula.
usages: Load Usages array.
Returns: If successful, NewLoadCombination and there isn't the Load Combination Element
with the same name returns an object for the newly created LoadCombination.
If such element exist and match desired one (has the same formula and the same
usages set), returns existing element. Otherwise null is returned.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Remarks:  Factors and Load Combinations arrays have the same dimension (n).
The Load Combination formula is equal to:
factors[0]*cases[0]*factors[1]*cases[1]*. . . factors[n]*cases[n].

Autodesk.Revit.Creation.Document.NewLoadCase(System.String,Autodesk.Revit.DB.Structure.LoadNature,Autodesk.Revit.DB.Category)
Creates a new instance of a LoadCase element within the project.
name: The not empty name for the Load Case Element to create.
nature:  The Load Case nature.
category:  The Load Case category.
Returns: If successful, NewLoadCase and there isn't the Load Case Element
with the same name returns an object for the newly created LoadCase.
If such element exist and match desired one (has the same nature and number),
returns existing element. Otherwise null is returned.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLoadUsage(System.String)
Creates a new instance of a LoadUsage element within the project.
name: The not empty name for the Load Usage Element to create.
Returns: If successful and there isn't the Load Usage Element with the
same name NewLoadUsage returns an object for the newly created LoadUsage.
If such element exist it returns existing element.
null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLoadNature(System.String)
Creates a new instance of a LoadNature element within the project.
name: The name for the Load Nature Element to create.
Returns: If successful and there isn't the Load Nature Element with the
same name NewLoadNature returns an object for the newly created LoadNature.
If such element exist it returns existing element.
null is returned if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new uniform hosted area load with polygonal shape within the project.
host: The host element (Floor or Wall) of the AreaLoad application.
force: The 3d area force applied to the first reference point.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.CurveArray,System.Int32[],System.Int32[],Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new unhosted area load with variable forces at the vertices within the project.
curvesArr: An array of curves that define the shape of the area load.
refPntIdxs: The indices of the curves in curvesArr that will be used to define
the reference points for the load.
ends: Identifies which of the curve end points should be used for the reference points,
for each member of refPntIdxs.  The value should be 0 for the start point or 1 for the end point of the curve.
force0: The 3d area force applied to the first reference point.
force1: The 3d area force applied to the second reference point.
Ignored if only one or two reference points are supplied.
force2: The 3d area force applied to the third reference point.
Ignored if only one or two reference points are supplied.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Remarks: The size of the refPntIdxs and
ends arrays must be the same, and a maximum of 3 values is permitted.

Autodesk.Revit.Creation.Document.NewAreaLoad(Autodesk.Revit.DB.CurveArray,System.Int32[],System.Int32[],System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new unhosted area load with variable forces at the vertices within the project.
curvesArr: An array of curves that define the shape of the area load curves.
refPntIdxs: The indices of the curves in curvesArr that will be used to define
the reference points for the load.
ends: Identifies which of the curve end points should be used for the reference points,
for each member of refPntIdxs.  The value should be 0 for the start point or 1 for the end point of the curve.
forces: The 3d area forces applied to each of the reference points in the refPntIdxs array.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.
Remarks: The size of the refPntIdxs, ends,
and forces arrays must be the same, and a maximum of 3 values is permitted.

Autodesk.Revit.Creation.Document.NewAreaLoad(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.AreaLoadType)
Creates a new area load in the project.
Creates a new uniform unhosted area load with polygonal shape within the project.
points: Vertexes of AreaLoad shape polygon.
force: The applied 3d area force.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the AreaLoad.
Returns: If successful, NewAreaLoad returns an object for the newly created AreaLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.Reference,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted line load within the project using data at an array of points.
reference:  The Geometry reference to Beam's, Brace's, Column's,
Wall's, Wall Foundation's, Slab's or Slab Foundation's analytical lines.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.Element,System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted line load within the project using data at two points.
host: The host element (Beam, Brace or Column) of the LineLoad application.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLineLoad(System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList`1{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new unhosted line load within the project using data at an array of points.
points: The end points of the LineLoad application.
forces: The applied 3d linear forces in the end points.
moments: The applied 3d linear moments in the end points.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns an object for the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewLineLoad(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.LineLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new line load within the project.
Creates a new unhosted line load within the project using data at two points.
point: The first point of the LineLoad application.
force: The applied 3d linear force in the first point.
moment: The applied 3d linear moment in the first point.
point1: The second point of the LineLoad application.
force1: The applied 3d linear force in the second point.
moment1: The applied 3d linear moment in the second point.
uniform: Set to True if you wish to create the uniform load.
projected: Set to True if you wish to create the projected load.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the LineLoad.
plane: Indicate the work plane of the LineLoad.
Returns: If successful, NewLineLoad returns the newly created LineLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewPointLoad(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.PointLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new hosted point load within the project.
reference:  The Geometry reference to Beam's, Brace's, Column's,
analytical line's end.
force: The 3d force.
moment: The 3d moment.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the PointLoad.
plane: Indicate the work plane of the PointLoad.
Returns: If successful, NewPointLoad returns an object for the newly created PointLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.

Autodesk.Revit.Creation.Document.NewPointLoad(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Structure.PointLoadType,Autodesk.Revit.DB.SketchPlane)
Creates a new point load within the project.
Creates a new unhosted point load within the project.
point: The point of the PointLoad application.
force: The 3d force.
moment: The 3d moment.
isReaction: Specifies if the load is a reaction load. The load cannot be modified if isReaction=True.
symbol: The symbol of the PointLoad.
plane: Indicate the work plane of the PointLoad.
Returns: If successful, NewPointLoad returns an object for the newly created PointLoad. null is returned
if the operation fails.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the product is not Revit Structure.